[
  {
    "_id": "hp_1",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Shimla, Shimla District (Himachal Pradesh)",
    "category": "Hill Station / Historical Town",
    "description": "Shimla District (Himachal Pradesh)",
    "timings": "As a town, always accessible; individual attractions (Viceregal Lodge, Jakhoo Temple, etc.) have opening & closing times; many shops open ~08:00–20:00 or similar. Not documented precise uniform hours for all sites.",
    "entry_fee": "Varies by attraction (for example, Viceregal Lodge has an entry fee; museums etc.). Not documented in aggregate.",
    "best_time": "March to June (pleasant weather, clear skies), also September–November (post monsoon, avoid heavy rains) to avoid harsh winter (snow) depending on tolerance.",
    "nearest_railway": "Kalka Railway Station (broad gauge) – approx 96 km to Shimla by road + toy train from Kalka to Shimla; also Shimla has its own narrow-gauge Toy Train station.",
    "nearest_bus": "Shimla Bus Stand (old bus stand or New Bus Stand / ISBT Shimla) — in Shimla town center — approx within city (< 1–3 km depending on your location).",
    "nearest_airport": "Jubbarhatti Airport (Shimla Airport) — approx 23 km from Shimla city centre.",
    "metro_station": "No metro available",
    "accessibility": "Road to Shimla from lower areas is well-developed though winding; within Shimla some steep roads & many stairs in old parts; partial wheelchair access in newer/hotel areas; toy train is narrow gauge & slow, not accessible; snow / ice in winter can make certain roads difficult.",
    "guided_tours": "Local guides available; Himachal Tourism offers guided walks, heritage walks; audio tours/museum guides for specific attractions.",
    "parking": "Several parking lots around Shimla (at outskirts / near Mall Road etc.); charges vary (₹ around few hundreds per day, more in peak season) — Not documented exact charge.",
    "nearby_amenities": "Wide range — hotels, guest houses, cafés, restaurants, shops, markets, ATMs, hospitals etc.",
    "official_website": "https://himachaltourism.nic.in/en-IN/destinations/shimla/intro",
    "wikipedia": "https://en.wikipedia.org/wiki/Shimla",
    "special_notes": "Shimla was summer capital during British Raj; has colonial architecture (Viceregal Lodge, Christ Church); toy train from Kalka is UNESCO heritage; snow in winter; festivals (Summer Festival, Ice Skating Carnival etc.)."
  },
  {
    "_id": "hp_2",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Manali, Kullu District (Himachal Pradesh)",
    "category": "Hill Station / Adventure Destination",
    "description": "Kullu District (Himachal Pradesh)",
    "timings": "Town & outdoor attractions accessible; roads & passes (like Rohtang) open seasonally; many shops open ~ morning to evening. Not documented uniform opening-closing.",
    "entry_fee": "For certain passes/tunnels/parks etc. Rohtang Pass often has permit / entry / toll; adventure activity fees vary; local sightseeing mostly free or small charges. Not documented full list.",
    "best_time": "May to early October (for passes open, fewer snow closures); winters good for snow lovers but some roads closed.",
    "nearest_railway": "Joginder Nagar (narrow gauge from Pathankot–Joginder Nagar line) approx 150–200 km depending on route; also nearest broad gauge is Chandigarh / Pathankot etc. Not documented exact best station + distance.",
    "nearest_bus": "Manali Bus Stand — within Manali town.",
    "nearest_airport": "Bhuntar Airport (Kullu–Manali Airport) — approx 50 km from Manali town.",
    "metro_station": "No metro available",
    "accessibility": "Access by road — some rough stretches; interior places require walking or trekking; winter snow can block access; not fully wheelchair friendly especially outside town.",
    "guided_tours": "Adventure operators for treks, rafting, paragliding, local guides speak Hindi/English; many tour packages.",
    "parking": "Available in Manali town; limited near popular attractions; charges vary.",
    "nearby_amenities": "Many hotels/resorts, restaurants/cafés, shops, medical centres.",
    "official_website": "https://himachaltourism.nic.in/en-IN/destinations/manali/intro",
    "wikipedia": "https://en.wikipedia.org/wiki/Manali,_Himachal_Pradesh",
    "special_notes": "Solang Valley, Rohtang Pass near by; river rafting in Beas; snow sports; cultural mix (Himachali, Tibetan etc.); peak tourist load in summer; environmental concerns near passes."
  },
  {
    "_id": "hp_3",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Dharamshala / McLeod Ganj, Kangra District (Himachal Pradesh)",
    "category": "Hill Station / Religious / Cultural (Tibetan Buddhist Centre)",
    "description": "Kangra District (Himachal Pradesh)",
    "timings": "Open access to town; monasteries have prayer times; museums etc have scheduled hours. Not documented full uniform opening/closing of attractions.",
    "entry_fee": "For monasteries generally free; museums (like Tibetan Museum) have small fees; outdoor nature/free areas free. Not documented exact.",
    "best_time": "October–March for snow and winter atmosphere; also April–June for pleasant weather and greenery.",
    "nearest_railway": "Pathankot Railway Station (broad gauge) approx 85 km or more; Kangra / Kangra Valley Railway (narrow gauge) smaller lines.",
    "nearest_bus": "Dharamshala Bus Stand in Dharamshala town; McLeod Ganj also has local bus stops.",
    "nearest_airport": "Kangra Airport (Gaggal Airport) — approx 13–20 km from Dharamshala / McLeod Ganj.",
    "metro_station": "No metro available",
    "accessibility": "Road access is good (though winding); some steep paths in McLeod Ganj; snow in winter can make roads tricky; room for improvement for wheelchair accessibility.",
    "guided_tours": "Available (local Tibetan guides, trekking guides, etc.), language support in Hindi/English; spiritual retreats present.",
    "parking": "Available in Dharamshala town; limited in McLeod Ganj; during peak season crowded.",
    "nearby_amenities": "Hotels, guest houses (from basic to luxury), cafés, Tibetan-style eateries, shops for crafts, restrooms etc.",
    "official_website": "https://himachaltourism.nic.in/en-IN/destinations/dharamshala/intro",
    "wikipedia": "https://en.wikipedia.org/wiki/Dharamshala",
    "special_notes": "Seat of Dalai Lama & the Tibetan government in exile; strong Tibetan culture; events like Losar; monasteries and meditation; scenery of Dhauladhar range."
  },
  {
    "_id": "hp_4",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Dalhousie, Chamba District (Himachal Pradesh)",
    "category": "Hill Station / Colonial Heritage",
    "description": "Chamba District (Himachal Pradesh)",
    "timings": "Town accessible always; many viewpoints / attractions have daylight hours. Not documented uniform closing times.",
    "entry_fee": "For some attractions (mini-treks, forest parks) small fees; otherwise free. Not documented exact amounts.",
    "best_time": "April to June & Sept to mid-October. Winters cold with snow; monsoon might bring landslides.",
    "nearest_railway": "Chakki Bank Railway Station (on narrow gauge) or Pathankot Junction (broad gauge) approx 80-90 km depending on route.",
    "nearest_bus": "Dalhousie Bus Stand (old/new) in town.",
    "nearest_airport": "Gaggal Airport (Kangra) or Pathankot Airport depending on service (Gaggal ~140-160 km perhaps; Pathankot closer for domestic flights) — Not documented precise nearest.",
    "metro_station": "No metro available",
    "accessibility": "Roads winding; some parts steep; in winter snow can block; trekking to certain points; not all places wheelchair friendly.",
    "guided_tours": "Local guide services, trekking, birding etc.",
    "parking": "Available in town; small parking fees likely at certain spots.",
    "nearby_amenities": "Hotels, colonial heritage bungalows, cafés, shops, restrooms, markets.",
    "official_website": "https://himachaltourism.nic.in/en-IN/destinations/dalhousie/intro",
    "wikipedia": "https://en.wikipedia.org/wiki/Dalhousie,_India",
    "special_notes": "Quiet, less crowded; colonial churches; views; good for short getaways from Delhi/Chandigarh."
  },
  {
    "_id": "hp_5",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Spiti Valley (incl. Kaza, monasteries), Lahaul & Spiti District (Himachal Pradesh)",
    "category": "Valley / High-Altitude Nature / Monasteries / Trekking / Eco-Tourism",
    "description": "Lahaul & Spiti District (Himachal Pradesh)",
    "timings": "Many roads / high passes open only in summer (usually May to October)—winter much blocked by snow. Attractions (monasteries etc.) open in daylight.",
    "entry_fee": "Small fees in some monasteries, permits needed (inner line permit for foreigners in some remote regions); eco sites may have fees. Not documented exact.",
    "best_time": "Late May to September (when roads are open, weather moderate).",
    "nearest_railway": "Broad gauge stations are far (e.g. Chandigarh / Pathankot / Ambala) plus long road journeys; narrow gauge options limited; nearest realistic is Shimla-Kalka route or broad gauge up to nearest hub then road. Not documented precise nearest RG station to Kaza etc.",
    "nearest_bus": "Kaza Bus Stand; intermediate stops in Spiti (e.g. Nako, Tabo etc.).",
    "nearest_airport": "Bhuntar Airport or Kullu–Manali Airport are ones used for getting close, then long road journey from there. Not documented exact distances for all segments.",
    "metro_station": "No metro available",
    "accessibility": "High altitude, remote roads; rough mountain roads; altitude sickness risk; many treks; not wheelchair-friendly outside basic towns.",
    "guided_tours": "Many adventure / trekking agencies provide guided treks and monastery tours; local guides in villages.",
    "parking": "Basic parking in towns; near monasteries limited; remote spots may have none.",
    "nearby_amenities": "Accommodation more basic; guest houses, tea houses; fewer luxury options; supply shops limited; medical facilities in larger towns.",
    "official_website": "Himachal Tourism site has pages for Spiti Valley/Sites.",
    "wikipedia": "https://en.wikipedia.org/wiki/Spiti_Valley",
    "special_notes": "Stunning landscapes, Tibetan Buddhist culture, ancient monasteries, cold desert terrain; high altitude trekking; passes like Kunzum; festivals like Losar etc."
  },
  {
    "_id": "hp_6",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Kasauli, Solan District (Himachal Pradesh)",
    "category": "Hill Station / Colonial Charm",
    "description": "Solan District (Himachal Pradesh)",
    "timings": "Town open always; attractions like Christ Church etc during daylight. Not documented specific opening hours.",
    "entry_fee": "None for general town; some attractions may have small donation or fee. Not documented.",
    "best_time": "March to June & September to November (pleasant weather; less rain; avoid extremes).",
    "nearest_railway": "Kalka Railway Station (broad gauge) — approx 35-40 km; also nearest narrow gauge / local links via Shimla toy or local stations. Not documented exact small-station distances.",
    "nearest_bus": "Kasauli Bus Stand in town.",
    "nearest_airport": "Chandigarh International Airport — approx 60-65 km away.",
    "metro_station": "No metro available",
    "accessibility": "Road access good; roads are steep in places; narrow streets in town; manageable for most; wheelchair access limited in older colonial parts & steep walks.",
    "guided_tours": "Local guides available; heritage walks; local tourist information through Himachal Tourism.",
    "parking": "Basic parking in town; limited availability in peak season.",
    "nearby_amenities": "Hotels, cafés, restaurants, shops, restrooms etc.",
    "official_website": "https://incredibleindia.gov.in/en/himachal-pradesh/kasauli",
    "wikipedia": "https://en.wikipedia.org/wiki/Kasauli",
    "special_notes": "Quiet, less crowded; colonial churches; views; good for short getaways from Delhi/Chandigarh."
  },
  {
    "_id": "hp_7",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Bir Billing, Kangra District (Himachal Pradesh)",
    "category": "Adventure / Eco-Tourism / Paragliding / Nature / Buddhist Monasteries",
    "description": "Kangra District (Himachal Pradesh)",
    "timings": "Paragliding operations often ~morning to afternoon depending on weather; monasteries daylight hours. Not documented full times.",
    "entry_fee": "Paragliding fee varies; monasteries often free/donation; trekking permits in some zones. Not documented exact numbers.",
    "best_time": "April to June & September to October (good weather, clearer skies). Avoid heavy monsoon & harsh winters.",
    "nearest_railway": "Nearest broad gauge: Pathankot or other; nearest smaller stations: Ahju/Chamba branch — Not documented exact.",
    "nearest_bus": "Bir / Billing Bus Terminus in local area.",
    "nearest_airport": "Kangra Airport (Gaggal) probably nearest; also Bhuntar etc depending on route. Not documented exact.",
    "metro_station": "No metro available",
    "accessibility": "Roads up to Bir decent; mountain terrain; trekking for certain viewpoints; not wheelchair friendly in remote parts; altitude moderate.",
    "guided_tours": "Yes — adventure tour operators for paragliding, trekking; local guides for monasteries; English / Hindi support.",
    "parking": "Local parking near Bir village; small charges.",
    "nearby_amenities": "Guesthouses, cafés, small restaurants, shops for adventure gear, restrooms; fewer luxury options.",
    "official_website": "Himachal Tourism has info pages; plus local paragliding operator sites.",
    "wikipedia": "https://en.wikipedia.org/wiki/Bir,_Himachal_Pradesh",
    "special_notes": "Bir Billing is considered the paragliding capital of India; scenic tea and herbal works; Tibetan Buddhist presence; nature retreats."
  },
  {
    "_id": "hp_8",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Kufri, Shimla District (Himachal Pradesh)",
    "category": "Hill Station / Nature Park / Snow Resort",
    "description": "Shimla District (Himachal Pradesh)",
    "timings": "Parks / fun parks open during daylight (morning till late afternoon) especially seasons. Snow arrivals in winter attract; some facilities shut during heavy snowfall. Not documented uniform times.",
    "entry_fee": "For amusement / fun parks etc small fees; nature park small fees; rest free. Not documented exact.",
    "best_time": "November to March for snow; March to June for green landscapes & avoiding deep snow or monsoons.",
    "nearest_railway": "Shimla Toy Train station (narrow gauge) / Kalka-Shimla line; or Shimla railway access via Kalka-Shimla line + road.",
    "nearest_bus": "Kufri Bus Stand (local) or buses from Shimla.",
    "nearest_airport": "Jubbarhatti Airport (Shimla) — approx ≈35-40 km (depending on route via Shimla). Not documented precisely.",
    "metro_station": "No metro available",
    "accessibility": "Roads up from Shimla; steep; snow can block; walking trails etc; not fully wheelchair friendly.",
    "guided_tours": "Local guides, day-tour operators from Shimla.",
    "parking": "Around Kufri near parks; charges small; may be crowded.",
    "nearby_amenities": "Small restaurants, lodges, shops; Shimla is nearby for full services.",
    "official_website": "Himachal Tourism Kufri pages.",
    "wikipedia": "https://en.wikipedia.org/wiki/Kufri",
    "special_notes": "Famous for snow-fun, winter sports; “Kufri Fun World”; Himalayan Nature Park; yaks etc; scenic views of peaks; botanical interest."
  },
  {
    "_id": "hp_9",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Khajjiar, Chamba District (Himachal Pradesh)",
    "category": "Hill Station / Meadow / Nature / Lake / Eco-tourism",
    "description": "Chamba District (Himachal Pradesh)",
    "timings": "Daylight access; lake / meadow accessible in summers; winter snowfall makes it inaccessible sometimes. Not documented exact hours.",
    "entry_fee": "Small fee for entry into certain park / forest zones; otherwise free. Not documented exact.",
    "best_time": "May to June, September, and October (peak blooms, moderate weather). Winter snow is attractive but harsh and roads may be blocked.",
    "nearest_railway": "Pathankot Railway Station (broad gauge) approx 100-120 km or more; smaller local stations / narrow gauge less relevant. Not documented exact local.",
    "nearest_bus": "Khajjiar Bus / local stand.",
    "nearest_airport": "Gaggal Airport (Kangra) or possibly Pathankot air access; Not documented precise.",
    "metro_station": "No metro available",
    "accessibility": "Road access from Dalhousie or Chamba; the roads are hilly; in winter snow makes travel hard; meadow walks easy; not wheelchair friendly overall.",
    "guided_tours": "Local guides available; forest department / eco-tourism agencies sometimes run tours.",
    "parking": "Available near lake / meadow; small parking lots; charges minimal.",
    "nearby_amenities": "Resorts, guest houses, eateries; shops for local crafts; restrooms.",
    "official_website": "Himachal Tourism has pages; also Chamba district tourism.",
    "wikipedia": "https://en.wikipedia.org/wiki/Khajjiar",
    "special_notes": "Often called “Mini Switzerland of India”; green meadows and lakes; Khajji Nag Temple; good for photography; cultural mix of Chamba region."
  },
  {
    "_id": "hp_10",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Kullu / Kullu Valley, Kullu District (Himachal Pradesh)",
    "category": "Valley / Cultural / Adventure / Nature",
    "description": "Kullu District (Himachal Pradesh)",
    "timings": "Town open always; certain adventure activities seasonal; valley passes seasonal. Not documented full timings.",
    "entry_fee": "For adventure sports / rafting / paragliding etc, separate; general visiting free. Not documented exact.",
    "best_time": "April to June & September to October. Peak summers; monsoon can bring heavy rain; winters cold but scenic in snow.",
    "nearest_railway": "Nearest broad gauge: Pathankot or Chandigarh etc; smaller stations in valley less connected by broad gauge. Not documented exact closest.",
    "nearest_bus": "Kullu Bus Stand in Kullu town.",
    "nearest_airport": "Bhuntar Airport — approx 10-20 km from Kullu town.",
    "metro_station": "No metro available",
    "accessibility": "Good road network; steep and winding; snow/landslides in monsoon and winter; remote valleys less accessible.",
    "guided_tours": "Yes — adventure outfitters; cultural tours; trekking guides.",
    "parking": "In town; at major attractions; small charges.",
    "nearby_amenities": "Hotels, restaurants, guest houses, shops etc.",
    "official_website": "https://himachaltourism.nic.in/en-IN/destinations/kullu/intro",
    "wikipedia": "https://en.wikipedia.org/wiki/Kullu",
    "special_notes": "Famous for its festivals, especially Kullu Dussehra; known as 'Valley of Gods'; river rafting in Beas."
  },
  {
    "_id": "hp_11",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Bhimakali Temple, Sarahan, Shimla/Bushahr border (Himachal Pradesh)",
    "category": "Religious / Temple (Shakti Peeth)",
    "description": "Shimla/Bushahr border (Himachal Pradesh)",
    "timings": "Temple hours likely sunrise to evening; seasonal variations. Not documented exact.",
    "entry_fee": "None generally; offerings/donations. Not documented.",
    "best_time": "May to October (temple festivals; when roads are accessible); winter may be harsh & cold.",
    "nearest_railway": "Shimla / Kalka or possibly railheads in lower Himachal; Not documented closest railway station distance.",
    "nearest_bus": "Sarahan Bus Stand in Sarahan village.",
    "nearest_airport": "The nearest airport likely Kullu/Bhuntar or Shimla or perhaps Chandigarh depending on route; Not documented exact.",
    "metro_station": "No metro available",
    "accessibility": "Mountainous roads; final approach may involve steep climb; snow can block; not fully wheelchair friendly.",
    "guided_tours": "Local guides in Bushahr region; pilgrimage tours in festivals.",
    "parking": "Basic parking in village; limited.",
    "nearby_amenities": "Guest houses, small eateries; shops; scenic vistas.",
    "official_website": "Local temple management pages exist; state tourism page mentions it.",
    "wikipedia": "https://en.wikipedia.org/wiki/Bhimakali_Temple",
    "special_notes": "One of the 51 Shakti Peethas; blends Bushahr culture; typical Himachali temple architecture (Kath-Kuni style); known for festivals and panoramic views."
  },
  {
    "_id": "hp_12",
    "state": "Himachal Pradesh",
    "stateCode": "HP",
    "place_name": "Hatu Peak, Narkanda (Shimla District, Himachal Pradesh)",
    "category": "Peak / Scenic Viewpoint / Religious (Hatu Mata Temple)",
    "description": "Narkanda (Shimla District, Himachal Pradesh)",
    "timings": "Daylight hours; temple open daily; visibility best on clear days. Not documented exact hours.",
    "entry_fee": "None generally; temple donation or offerings. Not documented.",
    "best_time": "May to October (for clear skies; avoid heavy snow & road closure); winter can be snowy and roads may be blocked.",
    "nearest_railway": "Shimla Toy Train station / Kalka-Shimla line for Shimla, then road to Narkanda (~) ; or nearest broad gauge somewhere far. Not documented exact nearest RG station.",
    "nearest_bus": "Narkanda Bus Stand — in town.",
    "nearest_airport": "Jubbarhatti (Shimla) Airport is nearest major airport to Shimla/Narkanda region; Not documented exact km to Hatu peak.",
    "metro_station": "No metro available",
    "accessibility": "Road up to certain height; steep climb/drive for peak; forest road; some walking required; not wheelchair friendly.",
    "guided_tours": "Local guides available; trekking tours etc.",
    "parking": "Basic parking near base / roadside; small charges or free depending on area.",
    "nearby_amenities": "Guest houses in Narkanda; small shops and restaurants; less amenities at the peak.",
    "official_website": "Not a major official site; local Himachal tourism pages mention Hatu Peak.",
    "wikipedia": "https://en.wikipedia.org/wiki/Hatu_peak",
    "special_notes": "Hatu Mata Temple at peak; forested with conifer & oak; views of Himalayan peaks; popular pilgrimage on certain festival days (e.g. first Sunday of Jyeshtha)."
  }
]